{"id":8793,"date":"2023-11-06T12:12:56","date_gmt":"2023-11-06T06:42:56","guid":{"rendered":"https:\/\/playerzpot.com\/blog\/?p=8793"},"modified":"2023-11-06T12:12:56","modified_gmt":"2023-11-06T06:42:56","slug":"understanding-popular-cricket-terminologies","status":"publish","type":"post","link":"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/","title":{"rendered":"Understanding Popular Cricket Terminologies"},"content":{"rendered":"<p>Cricket is one of the most popular sports in the world. The sport has a rich history, beginning in England and later spreading to other parts of the world, including India, Pakistan, New Zealand, Australia, Bangladesh, Afghanistan, South Africa, and Caribbean nations. Cricket has been followed ardently in these countries over the last several decades. However, Cricket is more than just a sport, with a full of expressions and terms to bewilder the newcomer who wants to learn more about the game. There are several terminologies in Cricket that are crucial to know while understanding the basics of the sport. Just like football, Cricket has a rich terminology with various terms often used by cricket experts.<\/p>\n<p>In this blog, we will look at certain terminologies that will help you understand more about the game of cricket.<\/p>\n<p><strong>Batting<\/strong><\/p>\n<p><strong>1. Stance:<\/strong> The batting stance is a fundamental position every batter adopts before facing a bowler. A proper stance is vital for balance, mobility, and shot execution. It involves the alignment of the player’s feet, body, and grip on the bat. Every batsman has their own batting stance depending on their comfort and style of play. The batsman&#8217;s stance is perpendicular to the bowler he\/she is facing and their shoulders face the incoming delivery. The grip on the bat varies between players. A well-structured batting stance enables players to pick up the shot effectively to the bowler’s deliveries.<\/p>\n<p><strong>2. Forward Defence:<\/strong> Forward Defence is one of the most important batting techniques. This technique has been taught as the basics to the beginners of the sport. Forward Defence is a defensive shot. While facing a delivery from the bowler, a batsman steps forward to meet the ball with a straight bat. The main objective of the forward defence is to block the ball, ensuring the ball doesn’t breach the batsman’s defence. This batting technique allows players to refrain the ball from dismantling the stumps or being caught by fielders. Forward defence needs to be employed by the batsmen to survive the strong bowling attack.<\/p>\n<p><strong>3. Cover Drive:<\/strong> Cover Drive is one of the most classic attacking shots in cricket. To play this shot, a batsman requires timing and precision, often resulting in sending the ball to the boundary line. The execution of the cover drive is not tough. In this shot, a batsman leans a little to the line of delivery, extending their front leg (left for a right-handed batsman and right for a left-handed batsman), and driving the ball with a straight bat through a region known as ‘cover’, which is situated between a point and extra cover. A batsman needs to see the gap at cover before executing a cover drive. V Kohli and B Azam are known for playing the cover drive. Cover Drive has become favourite among cricket fans because of its aesthetically pleasing and grace.<\/p>\n<p><strong>4. Pull Shot:<\/strong> Pull Shot is an aggressive and attacking batting stroke played against the short ball delivery. Executing a pull shot is somewhat difficult as a player has to master the art of picking up the short-pitched delivery. To execute this shot, a batsman rotates his back leg and swings his bat horizontally to contact with the ball. The main aim of the shot is to send the ball powerfully and squarely of the wicket on the leg side. Most of the pull shots drive the ball toward the boundary rope or a six. Pull Shot is risky but effective when timed well, as it can fetch the ball towards boundaries, and a mistimed shot will lead to dismissal.<\/p>\n<p><strong>5. Switch Hit<\/strong>: Switch Hit is one of the unconventional and skillful shots in cricket. This shot was popularized by former England batsman K Pietersen. It is an innovative stroke play where batsman change their usual batting stance and grip just before the bowler delivers the ball. By doing so, they effectively change their usual hand, turning a right-handed batsman into a left-handed batsman or vice versa. Switch Hit will often leave the fielders confused as the batsman identifies the gaps in the field and smartly changes their batting stance accordingly. To execute this shot, one needs to have hand-eye coordination with precise timing and quick decision-making.<\/p>\n<p><strong>Bowling<\/strong><\/p>\n<p><strong>1. Yorker:<\/strong> The Yorker is one of the skillful deliveries executed by fast bowlers. The main aim of this delivery is to send the ball right at the batsman&#8217;s toes. It is often called toe-crushing delivery. Yorker is the most challenging delivery to face for the batsmen as it’s directed at the base of the stumps and makes it hard for the batsman to hit the ball. Yorker is often used in ODIs and T20Is, especially during the death overs. Bowling yorkers in the death overs will circumscribe batsmen from scoring runs. While bowling a yorker, a bowler has to stretch their hand a bit to effectively deliver the ball at the base of the stumps.<\/p>\n<p><strong>2. Reverse Swing:<\/strong> Reserve Swing is often executed by fast bowlers where the ball starts to move in the opposite direction compared to conventional swing bowling. This type of bowling often leaves the batsmen confused while playing the shot. Either the ball will hit the stumps or the batsman needs to defend the ball. The direction of the ball is difficult for batsmen to judge. When the ball is reverse swinging, the delivery comes into the right-handed batsman if the smoother side of the ball is facing towards him. Reverse Swing is a potent weapon as it makes it challenging for the batsmen to hit the ball as it either gets edged or hits the stumps. Always be careful while facing reserve swing bowling.<\/p>\n<p><strong>3. Off-Spin<\/strong>: Off-spin is bowled by spin bowlers in cricket. It is often delivered by the right-arm bowler who imparts spin on the ball, which causes it to the off side to the leg side for a right-handed batsman. Off-spinner grips the ball with the index and middle fingers as it gives control to the ball and spins it clockwise. Off-spin comes up with different variations in flight, pace, and spin to deceive the batsmen. Quintessentially, the ball bounces and turns away from the batsman, making it difficult to play. With a sharp turn, the ball might turn the stumps if the batsman mistimes playing the shot. Off-spinners play a crucial role in controlling the game and taking wickets.<\/p>\n<p><strong>4. Slower Ball:<\/strong> A slower ball is often delivered by a fast bowler or medium pacer to disrupt the timing and expectations of the batsman. The delivery involves variation in pace where the bowler releases the ball at less speed, often by gripping the ball differently or changing in a seam position. The reduced speed at which the ball is delivered makes it challenging for the batsman to time the shot correctly, leading to wickets. The fast bowlers often adopt slower ball delivery in order to outsmart the batsmen who are looking to play aggressive strokes. This type of delivery is often used in limited-overs such as ODIs and T20Is. In slower ball, there are different varieties including the off-cutter, leg-cutter, and knuckleball.<\/p>\n<p><strong>5. Around The Wicket:<\/strong> Around The Wicket is a tactic where a bowler delivers the ball from the side of the non-dominant hand of the batsman. If the batsman is batting right, then the bowler is from the left side. The tactic is often used to create a different angle and exploit the batsman&#8217;s weaknesses, giving an edge to the bowler’s strategic advantage. This approach is employed by the bowlers in Test cricket and limited-overs, challenging the batsman’s technique. When a bowler bowls around the wicket, the batsman is careful while going for an aggressive shot. The spinners may use this tactic to target the rough patches on the pitch, while pacers may use it to bring the ball to the batsman.<\/p>\n<p><strong>Fielding<\/strong><\/p>\n<p><strong>1. Slips:<\/strong> Slips are the fielding position behind the batsman on the off-side. A player fielding at slip is basically assisting the wicketkeeper. They are placed with the aim of catching a ball edged by the batsman which is beyond the reach of the wicketkeeper. When a spinner is bowling, the fielder at the slip will be a little closer to the wicketkeeper, and when a pacer is bowling, the slip fielder stands wider. Fielders at slip take crucial catches when the wicketkeeper can’t. When there are three fielders at slip, the batsman will be careful while going for an aggressive shot. The number of fielders at slip can vary depending on the team’s strategy.<\/p>\n<p><strong>2. Cover:<\/strong> The fielders that are placed in the region between point and mid-off on the off-side are called cover. It’s a very busy area on the off-side to be fielding in as the batsmen often try to hit the ball in cover. Fielders placed at the cover play a very important role in refraining the batting from scoring runs and taking catches. They need to strong presence of mind and quick reflexes to stop the ball, thereby circumscribing the batter’s ability to score runs. Two fielders are placed on the cover and the gap between them is 18m to 20m, making it easy for batsmen to hit. The mistimed shot from the batsman may lead to dismissal in the form of a catch by a fielder at the cover.<\/p>\n<p><strong>3. Mid-On:<\/strong> Mid-On is a fielding position on the leg side, which is halfway between the non-striker and the bowler. The fielders on mid-on play a vital role in restricting the batsman from hitting the ball towards the leg side. They are positioned at the mid-on strategically to cut off singles and take catches if a batsman attempts lofty shots. This fielding position often puts pressure on the batsman and ensures any shots played in mid-on are quickly impeded, inhibiting the opposition from scoring runs freely and providing support to the bowlers for restricting the flow of runs. If a batsman mistimes their shot in mid-on, it will lead to dismissal.<\/p>\n<p><strong>4. Long-On:<\/strong> Long On is a placement of the fielder on the leg side, which is positioned back near the boundary line. The fielders standing at the long-on are entrusted with the task of stopping the ball from hitting the boundary line and taking the catches when the batsmen attempt lofty shots down the ground towards that direction. This position is placed strategically to intercept lofty shots and offers a chance to the batsman who is attempting to clear the boundary. The fielders placed at the long-on need to have good speed and strong throwing arms in order to circumscribe the opponent’s scoring opportunities and support the team’s bowlers to limit the runs conceded.<\/p>\n<p><strong>5. Fine Leg:<\/strong> Fine Leg is one of the most crucial positions in fielding, where the players are placed behind the batsman on the leg side and square to the wicket. The main aim of the fielders placed at the fine leg is to stop the boundaries and take the catches off leg-side shots. Fine-leg fielders are placed strategically to control the shots played toward the leg side of the batsman, especially when attempting a pull shot. Fielders placed at the fine leg must always be prepared and ready to take catches when the shots are hit in their direction. Fine leg is one of the important areas where the batsman attempts to hit the shot.<\/p>\n<div class=\"pvc_clear\"><\/div>\n<p id=\"pvc_stats_8793\" class=\"pvc_stats total_only  \" data-element-id=\"8793\" style=\"\"><i class=\"pvc-stats-icon medium\" aria-hidden=\"true\"><svg xmlns=\"http:\/\/www.w3.org\/2000\/svg\" version=\"1.0\" viewBox=\"0 0 502 315\" preserveAspectRatio=\"xMidYMid meet\"><g transform=\"translate(0,332) scale(0.1,-0.1)\" fill=\"\" stroke=\"none\"><path d=\"M2394 3279 l-29 -30 -3 -207 c-2 -182 0 -211 15 -242 39 -76 157 -76 196 0 15 31 17 60 15 243 l-3 209 -33 29 c-26 23 -41 29 -80 29 -41 0 -53 -5 -78 -31z\"\/><path d=\"M3085 3251 c-45 -19 -58 -50 -96 -229 -47 -217 -49 -260 -13 -295 52 -53 146 -42 177 20 16 31 87 366 87 410 0 70 -86 122 -155 94z\"\/><path d=\"M1751 3234 c-13 -9 -29 -31 -37 -50 -12 -29 -10 -49 21 -204 19 -94 39 -189 45 -210 14 -50 54 -80 110 -80 34 0 48 6 76 34 21 21 34 44 34 59 0 14 -18 113 -40 219 -37 178 -43 195 -70 221 -36 32 -101 37 -139 11z\"\/><path d=\"M1163 3073 c-36 -7 -73 -59 -73 -102 0 -56 133 -378 171 -413 34 -32 83 -37 129 -13 70 36 67 87 -16 290 -86 209 -89 214 -129 231 -35 14 -42 15 -82 7z\"\/><path d=\"M3689 3066 c-15 -9 -33 -30 -42 -48 -48 -103 -147 -355 -147 -375 0 -98 131 -148 192 -74 13 15 57 108 97 206 80 196 84 226 37 273 -30 30 -99 39 -137 18z\"\/><path d=\"M583 2784 c-38 -19 -67 -74 -58 -113 9 -42 211 -354 242 -373 16 -10 45 -18 66 -18 51 0 107 52 107 100 0 39 -1 41 -124 234 -80 126 -108 162 -133 173 -41 17 -61 16 -100 -3z\"\/><path d=\"M4250 2784 c-14 -9 -74 -91 -133 -183 -95 -150 -107 -173 -107 -213 0 -55 33 -94 87 -104 67 -13 90 8 211 198 130 202 137 225 78 284 -27 27 -42 34 -72 34 -22 0 -50 -8 -64 -16z\"\/><path d=\"M2275 2693 c-553 -48 -1095 -270 -1585 -649 -135 -104 -459 -423 -483 -476 -23 -49 -22 -139 2 -186 73 -142 361 -457 571 -626 285 -228 642 -407 990 -497 242 -63 336 -73 660 -74 310 0 370 5 595 52 535 111 1045 392 1455 803 122 121 250 273 275 326 19 41 19 137 0 174 -41 79 -309 363 -465 492 -447 370 -946 591 -1479 653 -113 14 -422 18 -536 8z m395 -428 c171 -34 330 -124 456 -258 112 -119 167 -219 211 -378 27 -96 24 -300 -5 -401 -72 -255 -236 -447 -474 -557 -132 -62 -201 -76 -368 -76 -167 0 -236 14 -368 76 -213 98 -373 271 -451 485 -162 444 86 934 547 1084 153 49 292 57 452 25z m909 -232 c222 -123 408 -262 593 -441 76 -74 138 -139 138 -144 0 -16 -233 -242 -330 -319 -155 -123 -309 -223 -461 -299 l-81 -41 32 46 c18 26 49 83 70 128 143 306 141 649 -6 957 -25 52 -61 116 -79 142 l-34 47 45 -20 c26 -10 76 -36 113 -56z m-2057 25 c-40 -58 -105 -190 -130 -263 -110 -324 -59 -707 132 -981 25 -35 42 -64 37 -64 -19 0 -241 119 -326 174 -188 122 -406 314 -532 468 l-58 71 108 103 c185 178 428 349 672 473 66 33 121 60 123 61 2 0 -10 -19 -26 -42z\"\/><path d=\"M2375 1950 c-198 -44 -350 -190 -395 -379 -18 -76 -8 -221 19 -290 114 -284 457 -406 731 -260 98 52 188 154 231 260 27 69 37 214 19 290 -38 163 -166 304 -326 360 -67 23 -215 33 -279 19z\"\/><\/g><\/svg><\/i> <img decoding=\"async\" width=\"16\" height=\"16\" alt=\"Loading\" src=\"https:\/\/playerzpot.com\/blog\/wp-content\/plugins\/page-views-count\/ajax-loader-2x.gif\" border=0 \/><\/p>\n<div class=\"pvc_clear\"><\/div>\n<div style=\"margin-top: 0px; margin-bottom: 0px;\" class=\"sharethis-inline-share-buttons\" ><\/div>","protected":false},"excerpt":{"rendered":"<p>Cricket is one of the most popular sports in the world. The sport has a rich history, beginning in England and later spreading to other parts of the world, including India, Pakistan, New Zealand, Australia, Bangladesh, Afghanistan, South Africa, and Caribbean nations. Cricket has been followed ardently in these countries over the last several decades. [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":8794,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[10,2907],"tags":[3047,24],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Understanding Popular Cricket Terminologies<\/title>\n<meta name=\"description\" content=\"There are several terminologies in Cricket that are crucial to know while understanding the basics of the sport.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Understanding Popular Cricket Terminologies\" \/>\n<meta property=\"og:description\" content=\"There are several terminologies in Cricket that are crucial to know while understanding the basics of the sport.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/\" \/>\n<meta property=\"og:site_name\" content=\"Latest Sports Trends &amp; News\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/PlayerzPot\/\" \/>\n<meta property=\"article:published_time\" content=\"2023-11-06T06:42:56+00:00\" \/>\n<meta property=\"og:image\" content=\"http:\/\/playerzpot.com\/blog\/wp-content\/uploads\/2023\/11\/Cricket-Terminologies.png\" \/>\n\t<meta property=\"og:image:width\" content=\"800\" \/>\n\t<meta property=\"og:image:height\" content=\"400\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Playerzpot Sports Guru\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@playerzpot\" \/>\n<meta name=\"twitter:site\" content=\"@playerzpot\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Playerzpot Sports Guru\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/\"},\"author\":{\"name\":\"Playerzpot Sports Guru\",\"@id\":\"https:\/\/playerzpot.com\/blog\/#\/schema\/person\/7708208e8bba8ce8cae0d33997355dc6\"},\"headline\":\"Understanding Popular Cricket Terminologies\",\"datePublished\":\"2023-11-06T06:42:56+00:00\",\"dateModified\":\"2023-11-06T06:42:56+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/\"},\"wordCount\":1900,\"publisher\":{\"@id\":\"https:\/\/playerzpot.com\/blog\/#organization\"},\"keywords\":[\"Cricket Terminologies\",\"Fantasy Cricket\"],\"articleSection\":[\"Cricket\",\"Fantasy Cricket\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/\",\"url\":\"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/\",\"name\":\"Understanding Popular Cricket Terminologies\",\"isPartOf\":{\"@id\":\"https:\/\/playerzpot.com\/blog\/#website\"},\"datePublished\":\"2023-11-06T06:42:56+00:00\",\"dateModified\":\"2023-11-06T06:42:56+00:00\",\"description\":\"There are several terminologies in Cricket that are crucial to know while understanding the basics of the sport.\",\"breadcrumb\":{\"@id\":\"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/playerzpot.com\/blog\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Understanding Popular Cricket Terminologies\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/playerzpot.com\/blog\/#website\",\"url\":\"https:\/\/playerzpot.com\/blog\/\",\"name\":\"Playerzpot Blog\",\"description\":\"Latest fantasy sports updates for cricket, football &amp; Kabaddi in India\",\"publisher\":{\"@id\":\"https:\/\/playerzpot.com\/blog\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/playerzpot.com\/blog\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/playerzpot.com\/blog\/#organization\",\"name\":\"PlayerzPot\",\"url\":\"https:\/\/playerzpot.com\/blog\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/playerzpot.com\/blog\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/playerzpot.com\/blog\/wp-content\/uploads\/2023\/01\/logo-e1675168013423.png\",\"contentUrl\":\"https:\/\/playerzpot.com\/blog\/wp-content\/uploads\/2023\/01\/logo-e1675168013423.png\",\"width\":260,\"height\":37,\"caption\":\"PlayerzPot\"},\"image\":{\"@id\":\"https:\/\/playerzpot.com\/blog\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/PlayerzPot\/\",\"https:\/\/twitter.com\/playerzpot\",\"https:\/\/www.instagram.com\/playerzpot_official\/\",\"https:\/\/www.linkedin.com\/company\/playerzpot-media-pvt-ltd\/\",\"https:\/\/www.youtube.com\/playerzpot\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/playerzpot.com\/blog\/#\/schema\/person\/7708208e8bba8ce8cae0d33997355dc6\",\"name\":\"Playerzpot Sports Guru\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/playerzpot.com\/blog\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/39556eb35c0853bf650ca4b882db9469?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/39556eb35c0853bf650ca4b882db9469?s=96&d=mm&r=g\",\"caption\":\"Playerzpot Sports Guru\"},\"url\":\"https:\/\/playerzpot.com\/blog\/author\/social-638\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Understanding Popular Cricket Terminologies","description":"There are several terminologies in Cricket that are crucial to know while understanding the basics of the sport.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/","og_locale":"en_US","og_type":"article","og_title":"Understanding Popular Cricket Terminologies","og_description":"There are several terminologies in Cricket that are crucial to know while understanding the basics of the sport.","og_url":"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/","og_site_name":"Latest Sports Trends &amp; News","article_publisher":"https:\/\/www.facebook.com\/PlayerzPot\/","article_published_time":"2023-11-06T06:42:56+00:00","og_image":[{"width":800,"height":400,"url":"http:\/\/playerzpot.com\/blog\/wp-content\/uploads\/2023\/11\/Cricket-Terminologies.png","type":"image\/png"}],"author":"Playerzpot Sports Guru","twitter_card":"summary_large_image","twitter_creator":"@playerzpot","twitter_site":"@playerzpot","twitter_misc":{"Written by":"Playerzpot Sports Guru","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/#article","isPartOf":{"@id":"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/"},"author":{"name":"Playerzpot Sports Guru","@id":"https:\/\/playerzpot.com\/blog\/#\/schema\/person\/7708208e8bba8ce8cae0d33997355dc6"},"headline":"Understanding Popular Cricket Terminologies","datePublished":"2023-11-06T06:42:56+00:00","dateModified":"2023-11-06T06:42:56+00:00","mainEntityOfPage":{"@id":"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/"},"wordCount":1900,"publisher":{"@id":"https:\/\/playerzpot.com\/blog\/#organization"},"keywords":["Cricket Terminologies","Fantasy Cricket"],"articleSection":["Cricket","Fantasy Cricket"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/","url":"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/","name":"Understanding Popular Cricket Terminologies","isPartOf":{"@id":"https:\/\/playerzpot.com\/blog\/#website"},"datePublished":"2023-11-06T06:42:56+00:00","dateModified":"2023-11-06T06:42:56+00:00","description":"There are several terminologies in Cricket that are crucial to know while understanding the basics of the sport.","breadcrumb":{"@id":"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/playerzpot.com\/blog\/understanding-popular-cricket-terminologies\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/playerzpot.com\/blog\/"},{"@type":"ListItem","position":2,"name":"Understanding Popular Cricket Terminologies"}]},{"@type":"WebSite","@id":"https:\/\/playerzpot.com\/blog\/#website","url":"https:\/\/playerzpot.com\/blog\/","name":"Playerzpot Blog","description":"Latest fantasy sports updates for cricket, football &amp; Kabaddi in India","publisher":{"@id":"https:\/\/playerzpot.com\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/playerzpot.com\/blog\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/playerzpot.com\/blog\/#organization","name":"PlayerzPot","url":"https:\/\/playerzpot.com\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/playerzpot.com\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/playerzpot.com\/blog\/wp-content\/uploads\/2023\/01\/logo-e1675168013423.png","contentUrl":"https:\/\/playerzpot.com\/blog\/wp-content\/uploads\/2023\/01\/logo-e1675168013423.png","width":260,"height":37,"caption":"PlayerzPot"},"image":{"@id":"https:\/\/playerzpot.com\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/PlayerzPot\/","https:\/\/twitter.com\/playerzpot","https:\/\/www.instagram.com\/playerzpot_official\/","https:\/\/www.linkedin.com\/company\/playerzpot-media-pvt-ltd\/","https:\/\/www.youtube.com\/playerzpot"]},{"@type":"Person","@id":"https:\/\/playerzpot.com\/blog\/#\/schema\/person\/7708208e8bba8ce8cae0d33997355dc6","name":"Playerzpot Sports Guru","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/playerzpot.com\/blog\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/39556eb35c0853bf650ca4b882db9469?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/39556eb35c0853bf650ca4b882db9469?s=96&d=mm&r=g","caption":"Playerzpot Sports Guru"},"url":"https:\/\/playerzpot.com\/blog\/author\/social-638\/"}]}},"_links":{"self":[{"href":"https:\/\/playerzpot.com\/blog\/wp-json\/wp\/v2\/posts\/8793"}],"collection":[{"href":"https:\/\/playerzpot.com\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/playerzpot.com\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/playerzpot.com\/blog\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/playerzpot.com\/blog\/wp-json\/wp\/v2\/comments?post=8793"}],"version-history":[{"count":1,"href":"https:\/\/playerzpot.com\/blog\/wp-json\/wp\/v2\/posts\/8793\/revisions"}],"predecessor-version":[{"id":8795,"href":"https:\/\/playerzpot.com\/blog\/wp-json\/wp\/v2\/posts\/8793\/revisions\/8795"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/playerzpot.com\/blog\/wp-json\/wp\/v2\/media\/8794"}],"wp:attachment":[{"href":"https:\/\/playerzpot.com\/blog\/wp-json\/wp\/v2\/media?parent=8793"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/playerzpot.com\/blog\/wp-json\/wp\/v2\/categories?post=8793"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/playerzpot.com\/blog\/wp-json\/wp\/v2\/tags?post=8793"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}